In [2]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('sqlite_warehouse_mgt.db')

sql = '''
SELECT name FROM sqlite_schema
WHERE type='table'
ORDER BY name;
'''

df = pd.read_sql_query(sql, conn)

df.head()

        name
0    product
1      stock
2  warehouse

In [2]:
print(sqlite3.sqlite_version)

3.35.5

In [3]:
sql = '''
SELECT * FROM stock;
'''
df = pd.read_sql_query(sql, conn)
df

      id  product_id  inventory  warehouse_id
0      1      458932         41             1
1      2      765219          6             2
2      3      102354         11             1
3      4      879621         36             2
4      5      543210         39             1
..   ...         ...        ...           ...
96    97      365824         10             3
97    98      482736         22             1
98    99      695817         27             2
99   100      314592         19             1
100  101      728361         33             3

[101 rows x 4 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            101 non-null    int64
 1   product_id    101 non-null    int64
 2   inventory     101 non-null    int64
 3   warehouse_id  101 non-null    int64
dtypes: int64(4)
memory usage: 3.3 KB

In [5]:
sql = '''
SELECT * FROM product;
'''
df = pd.read_sql_query(sql, conn)
df

    product_id                        name
0       102354            Hemnes Bed Frame
1       124689             Lack Wall Shelf
2       146892           Ekenaset Armchair
3       159874  Lillangen Bathroom Cabinet
4       182704              Rodtoppa Duvet
..         ...                         ...
78      927846         Raskog Utility Cart
79      928346         Markus Swivel Chair
80      935178               Braviken Sink
81      963258          Fjallbo Shelf Unit
82      986753                 Ektorp Sofa

[83 rows x 2 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83 entries, 0 to 82
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   product_id  83 non-null     int64
 1   name        83 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.4+ KB

In [3]:
sql = '''
SELECT * FROM warehouse;
'''
df = pd.read_sql_query(sql, conn)
df

  warehouse_id    location
0            1  New Castle
1            2    Hamshire
2            3    Hogwarts
3        Jokke    Hogwarts
4           Me       asdfa

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   warehouse_id  3 non-null      int64
 1   location      3 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes